dfe-stubs/src/main/resources/wsdl/nfce/mg/hom/event_substitute_cancel.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.0-wls122140-b220215.0856 svn-revision#unknown. --><!-- Generated by JAX-WS RI (http://jax-ws.java.net). RI's version is JAX-WS RI 2.3.0-wls122140-b220215.0856 svn-revision#unknown. -->
<definitions
        xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata"
        xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/"
        xmlns:tns="http://www.portalfiscal.inf.br/nfe/wsdl/NFeRecepcaoEvento4"
        xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/"
        targetNamespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeRecepcaoEvento4" name="NFeRecepcaoEvento4">
    <types>
        <xsd:schema>
            <xsd:import namespace="http://www.portalfiscal.inf.br/nfe/wsdl/NFeRecepcaoEvento4"
                        schemaLocation="https://hnfce.fazenda.mg.gov.br:443/nfce/services/NFeRecepcaoEvento4?xsd=1"/>
        </xsd:schema>
    </types>
    <message name="nfeRecepcaoEvento">
        <part name="nfeDadosMsg" element="tns:nfeDadosMsg"/>
    </message>
    <message name="nfeRecepcaoEventoResponse">
        <part name="nfeRecepcaoEventoResult" element="tns:nfeResultMsg"/>
    </message>
    <portType name="NFeRecepcaoEvento4Soap">
        <operation name="nfeRecepcaoEvento">
            <input wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NFeRecepcaoEvento4/nfeRecepcaoEvento"
                   message="tns:nfeRecepcaoEvento"/>
            <output wsam:Action="http://www.portalfiscal.inf.br/nfe/wsdl/NFeRecepcaoEvento4/NFeRecepcaoEvento4Soap/nfeRecepcaoEventoResponse"
                    message="tns:nfeRecepcaoEventoResponse"/>
        </operation>
    </portType>
    <binding name="NFeRecepcaoEvento4SoapBinding" type="tns:NFeRecepcaoEvento4Soap">
        <soap12:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="nfeRecepcaoEvento">
            <soap12:operation
                    soapAction="http://www.portalfiscal.inf.br/nfe/wsdl/NFeRecepcaoEvento4/nfeRecepcaoEvento"/>
            <input>
                <soap12:body use="literal"/>
            </input>
            <output>
                <soap12:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="NFeRecepcaoEvento4">
        <port name="NFeRecepcaoEvento4Soap" binding="tns:NFeRecepcaoEvento4SoapBinding">
            <soap12:address location="https://hnfce.fazenda.mg.gov.br:443/nfce/services/NFeRecepcaoEvento4"/>
        </port>
    </service>
</definitions>